Autodesk.Revit.DB.MeshFromGeometryOperationIssue
Issues encountered while constructing meshes as fallbacks
for geometrical operations.
Since:
2015
Issues, which can be encountered while building a mesh as a
fallback for geometrical operations.
Since:
2015

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NumberOfIssueTypes
Not a code of some issue, but the number of known types of issues.
Issues of this type should not be
present in TessellatedShapeBuilderResult. Please notify
Autodesk support if encountered

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NotSetYet
An issue has not been set yet.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.InternalError
An internal Revit problem. Issues of this type should not
normally be present in MeshFromGeometryOperationResult.
Please notify Autodesk support if encountered.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.InternalMissingError
An internal Revit problem. Issues of this type should not be
present in TessellatedShapeBuilderResult. Please notify
Autodesk support if encountered.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.InternalUtilityError
An internal Revit problem. Issues of this type should not
normally be present in MeshFromGeometryOperationResult.
Please notify Autodesk support if encountered.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.MissingCurvesInInputLoop
An input curve loop has missing curves.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NonContinuousInputCurveLoop
A non-continuous input curve loop. Either wrong curve flips
or genuine gaps.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.InputCurveLoopWrongOpenFlag
An input curve has incorrect open flag.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.InputCurveLoopProblemWithFallback
An unidentified problem with an input curve loop. A fallback
is attempted.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NonPlanarProfileLoop
Among curve loops expected as input parameters while building
a mesh, some are not planar.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.CurveLoopsWithoutCurvesInInput
Among curve loops expected as input parameters while building
a mesh, some are not empty, but do not have any curves.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.EmptyCurveLoopsInInput
Among curve loops expected as input parameters while building
a mesh, some are empty.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.MissingCurveLoopsInInput
While several curve loops were expected as one of the input
parameters while building a mesh, some of them were not provided.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NoUsableCurveLoopsInInput
While one or more curve loops were expected as one of the input
parameters while building a mesh, no loops containing curves were
provided.

Autodesk.Revit.DB.MeshFromGeometryOperationIssue.AllFine
No issues were encountered. Issues of this type should not
be present in MeshFromGeometryOperationResult.